
<!DOCTYPE HTML>
<html lang="en">
<head>
<meta charset="utf-8">
<!-- <meta http-equiv="Content-Type" content="text/html; charset=utf-8"> -->
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="author" content="Olivier Barais">
<link rel="author" href="https://plus.google.com/+OlivierBarais">
 
<!-- Latest compiled and minified CSS -->
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap.min.css" integrity="sha384-BVYiiSIFeK1dGmJRAkycuHAHRg32OmUcww7on3RYdg4Va+PmSTsz/K68vbdEjh4u" crossorigin="anonymous">

<!-- Optional theme -->
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/css/bootstrap-theme.min.css" integrity="sha384-rHyoN1iRsVXV4nD0JutlnGaslCJuC7uwjduW9SVrLvRYooPp2bWYgmgJQIXwl/Sp" crossorigin="anonymous">
<link rel="stylesheet" href="/assets/main.css">
<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.2.0/jquery.min.js"></script>

<!-- Latest compiled and minified JavaScript -->
<script src="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.7/js/bootstrap.min.js" integrity="sha384-Tc5IQib027qvyjSMfHjOMaLkfuWVxZxUPnCJA7l2mCWNIpG9mGCD8wGNIcPD7Txa" crossorigin="anonymous"></script>
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css">

<style>body {
    padding-top: 60px;
  }
  @media (max-width: 979px) {
    body {
      padding-top: 60px;
    }
  }
</style>

<title>Publications | Olivier Barais</title>

<meta name="description" content="Book Chapters, Conferences, Journals, Presentations, Refereed research computer science">

<!-- Add custom CSS here -->

<!-- <link rel="shortcut icon" href="favicon.ico"> -->
<link rel="icon" href="/favicon.ico">


</head>
<body>

    	<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
		<div class="container">
			<div class="navbar-header">
				<button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
					<span class="sr-only">Toggle navigation</span> <span class="icon-bar"></span> <span class="icon-bar"></span> <span class="icon-bar"></span>
				</button>
                <a class="navbar-brand" href="/">olivier.barais</a>
			</div>

			<!-- Collect the nav links, forms, and other content for toggling -->
			<div class="collapse navbar-collapse navbar-right navbar-ex1-collapse">
				<ul class="nav navbar-nav">
                    <li><a href="/">Home</a></li>
					<li><a href="/publications/">Publications</a></li>
					<li><a href="/teaching/">Teaching</a></li>
                    <li><a href="/research/">Research</a></li>
                    <li><a href="/blog/">Blog</a></li>
                    <li><a href="/photos/">Photos</a></li>
                    <li><a href="/contact/">Contact</a></li>
				</ul>
			</div>
			<!-- /.navbar-collapse -->
		</div>
		<!-- /.container -->
	</nav>


    <div class="container">
        <div class="row">
            <div class="col-lg-10">

            <h1 style="text-align: center;"><b>This page is outdated. Please have a look to <a href="https://scholar.google.fr/citations?user=LV5i8X4AAAAJ&hl=fr"> google scholar</a> to get my last publications.</b></h1>

<BR>
<BR>
<BR>
<BR>
<BR>

<h1>Publications, Demonstrations and Presentations</h1>
<hr>

<H3><A NAME="SECTION000110100000000000000">
Journal</A>
</H3>

<P align="justify">
<DL COMPACT>
<DD align="justify">Joao Bosco Ferreira Filho, <span style="color:#428bca;">Olivier Barais</span>, Mathieu Acher, J&#233;r&#244;me Le Noir, Axel Legay and Benoit Baudry. <SPAN  CLASS="textbf">Generating Counterexamples of Model-based Software Product Lines</SPAN>, dans <SPAN  CLASS="textit">Journal on Software Tools for Technology Transfer (STTT)</SPAN>, Springer 341, (2014)<BR>
</DD><BR>
<DT></DT>

<DD align="justify">
Jean-Marc J&#233;z&#233;quel, Benoit Combemale, <span style="color:#428bca;">Olivier Barais</span>, Martin Monperrus, Fran&#231;ois Fouquet, <SPAN  CLASS="textbf">Mashup of metalanguages and its implementation in the Kermeta language workbench</SPAN>, dans Software and Systems Modeling (SoSyM), dans  <SPAN  CLASS="textit">Software and Systems Modeling (SoSyM)</SPAN>,(2013)
</DD>

<DT></DT>
<BR>
<DD align="justify">
Gilles Perrouin, Gilles Vanwormhoudt, Brice Morin, Philippe Lahire, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel, <SPAN  CLASS="textbf">Weaving Variability into Domain Metamodels</SPAN>, dans Software and Systems Modeling (SoSyM), dans  <SPAN  CLASS="textit">Software and Systems Modeling (SoSyM)</SPAN>,dec.(2012)
</DD>
<DT></DT>
<BR>

<DD align="justify">
Sagar Sen, Naouel Moha, Vincent Mah&#233;, <span style="color:#428bca;">Olivier Barais</span>, Benoit Baudry, et Jean-Marc J&#233;z&#233;quel (2012) <SPAN  CLASS="textbf">Reusable model transformations</SPAN>. dans <SPAN  CLASS="textit">Software and Systems Modeling (SoSyM)</SPAN>, tba:346-379.(2012)
</DD>
<DT></DT>
<BR>
<DD align="justify"><P>
Naouel Moha , Sagar Sen, Cyril Faucher, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel <SPAN  CLASS="textbf">Evaluation of Kermeta for solving graph-based problems</SPAN>. dans <SPAN  CLASS="textit">International Journal on Software Tools for Technology Transfer (STTT)</SPAN>, 12(3-4):273-285. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Franck Chauvel , <span style="color:#428bca;">Olivier Barais</span> , Isabelle Borne et Jean-Marc J&#233;z&#233;quel  <SPAN  CLASS="textbf">Un processus &#224; base de mod&#232;les pour les syst&#232;mes auto-adaptatifs</SPAN>. Revue de l'Electricit&#233; et de l'Electronique (REE) (2009). 
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc  J&#233;z&#233;quel, Franck Fleurey et Arnor Solberg, Models at Runtime to Support Dynamic Adaptation. IEEE Computer.  p46-53, (2009) 
</DD>
<DT></DT>
<BR><DD align="justify">
S&#233;bastien Saudrais, <span style="color:#428bca;">Olivier Barais</span>, Laurence Duchien et Noel Plouzeau. <SPAN  CLASS="textbf">From formal specifications to QoS monitors</SPAN>. dans <SPAN  CLASS="textit">Journal of Object Technology, Special Issue on Advances in Quality of Service Management</SPAN>, 2007, 6(11):7-24. 
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Philippe Lahire, Alexis Muller, No&#235;l Plouzeau et Gilles Vanwormhoudt. <SPAN  CLASS="textbf">&#201;valuation de l'apport des aspects, des sujets et des vues pour la composition et la r&#233;utilisation des mod&#232;les</SPAN>. dans <SPAN  CLASS="textit">la Revue RSTI-L'Objet. Herm&#232;s Sciences</SPAN>. 2007 2-3/2007(13):177-212.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Alexis Muller et Nicolas Pessemier. <SPAN  CLASS="textbf">Vers une S&#233;paration Entit&#233;s/Fonctions au sein d'une Architecture Logicielle &#224; base de Composants.</SPAN> dans <SPAN  CLASS="textit">la Revue RSTI-L'Objet. Herm&#232;s Sciences.</SPAN> 2005 2-3/2007(13):115-139.  
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Laurence Duchien. <SPAN  CLASS="textbf">TranSAT : ma&#238;triser l'&#233;volution d'une architecture logicielle.</SPAN> dans <SPAN  CLASS="textit">la Revue RSTI-L'Objet. Herm&#232;s Sciences.</SPAN> 2004 2-3/2004(10):103-116.  
</DD>
<DT></DT>
<BR><DD align="justify">
</DD>
</DL>

<H3><A NAME="SECTION000110200000000000000">
Book Chapter</A>
</H3>


<P>
<DL COMPACT>
<DD>Jean-Marc J&#233;z&#233;quel, <span style="color:#428bca;">Olivier Barais</span>, et Franck Fleurey. <SPAN  CLASS="textbf">Model Driven Language Engineering with Kermeta</SPAN>. Dans <SPAN  CLASS="textit">3rd Summer School on Generative and Transformational Techniques in Software Engineering</SPAN>. (Joao M. Fernandes and Ralf Lammel and Joao Saraiva and Joost Visser, Eds.), LNCS 6491, Springer. (2010)
</DD>
<BR>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Julia Lawall, Anne-Fran&#231;oise Le Meur et Laurence Duchien. <SPAN  CLASS="textbf">Software Architecture Evolution</SPAN>. dans <SPAN  CLASS="textit">Software Evolution</SPAN>. (Tom Mens and Serge Demeyer eds, Eds.), Springer Verlag. 2008. pages 233-262.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span> et Laurence Duchien. <SPAN  CLASS="textbf">SafArchie Studio: An ArgoUML extension to build Safe Architectures.</SPAN> dans <SPAN  CLASS="textit">Architecture Description Languages</SPAN>. (en, Eds.), Springer, pages 85-100. 
</DD>
<DT></DT>
<DD>
</DD>
</DL>


<H3><A NAME="SECTION000110300000000000000">
Conferences and Symposiums (proceedings) <SMALL CLASS="TINY">(Avec &#233;dition d'actes et comit&#233; de s&#233;lection)</SMALL></A>
</H3>

<P>

<P>
<DL COMPACT>
<DD>Guillaume B&#233;can, Nicolas Sannier, Mathieu Acher, <span style="color:#428bca;">Olivier Barais</span>, Arnaud Blouin, Benoit Baudry <SPAN  CLASS="textbf">Automating the Formalization of Product Comparison Matrices</SPAN>, In <SPAN  CLASS="textit">Proceeding of the International Conference on Automated Software Engineering (ASE), 2014</SPAN>. September 15 - 19, 2014
V&#228;ster&#229;s, Sweden.
</DD>
<DT></DT>
<BR><DD align="justify">
Thomas Hartmann, Francois Fouquet, Gregory Nain, Brice Morin, Jacques Klein, <span style="color:#428bca;">Olivier Barais</span>, and Yves Le Traon <SPAN  CLASS="textbf">A Native Versioning Concept to Support Historized Models at Runtime</SPAN>, In <SPAN  CLASS="textit">ACM/IEEE 17th International Conference on Model Driven Engineering Languages and Systems (MODELS 2014)</SPAN>, Valencia, Spain, september 28 - october 03, ACM. 
</DD>
<DT></DT>
<BR><DD align="justify">
Mathieu Acher, Benoit Baudry, <span style="color:#428bca;">Olivier Barais</span> and Jean-Marc J&#233;z&#233;quel <SPAN  CLASS="textbf">Customization and 3D Printing: A Challenging Playground for Software Product Lines</SPAN>, In <SPAN  CLASS="textit">18th International Software Product Line Conference (2014)</SPAN>, Firenze, Italy, September 15-19, 2014, ACM.
</DD>
<DT></DT>
<BR><DD align="justify">
Dimitri Van Landuyt, Steven Op De Beeck, Aram Hovsepyan, Sam Michiels, Wouter Joosen, Sven Meynckens, Gjalt De Jong, <span style="color:#428bca;">Olivier Barais</span>, Mathieu Acher <SPAN  CLASS="textbf">Towards Managing Variability in the Safety Design of an Automotive Hall Effect Sensor</SPAN>, In <SPAN  CLASS="textit">18th International Software Product Line Conference (2014)</SPAN>, Firenze, Italy, September 15-19, 2014, ACM.
</DD>
<DT></DT>
<BR><DD align="justify">
Julien Richard-Foy, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel <SPAN  CLASS="textbf">Using Path-Dependent Types to Build Type Safe JavaScript Foreign Function Interfaces</SPAN>.  In <SPAN  CLASS="textit">14th International Conference on Web Engineering (ICWE'2014)</SPAN>, Toulouse, France, July 1-4 July.
</DD>
<DT></DT>
<BR><DD align="justify">
Inti Y. Gonzalez-Herrera, Johann Bourcier, Erwan Daubert, Walter Rudametkin, <span style="color:#428bca;">Olivier Barais</span>, Fran&#231;ois Fouquet, Jean-Marc J&#233;z&#233;quel <SPAN  CLASS="textbf">Scapegoat: An Adaptive Monitoring Framework for Component-Based Systems</SPAN>. In <SPAN  CLASS="textit">2014 IEEE/IFIP Conference on Software Architecture, WICSA 2014</SPAN>, Sydney, Australia, April 7-11, 2014, 67-76, IEEE. 
</DD>
<DT></DT>
<BR><DD align="justify">
Emmanuelle Rouill&#233;, Beno&#238;t Combemale, <span style="color:#428bca;">Olivier Barais</span>, David Touzet, Jean-Marc J&#233;z&#233;quel <SPAN  CLASS="textbf">Improving Reusability in Software Process Lines</SPAN>. In <SPAN  CLASS="textit">39th Euromicro Conference on Software Engineering and Advanced Applications, SEAA 2013 </SPAN>, Santander, Spain, September 4-6, 2013, 90-93. IEEE. 
</DD>
<DT></DT>
<BR><DD align="justify">
Julien Richard-Foy, <span style="color:#428bca;">Olivier Barais</span> and Jean-Marc J&#233;z&#233;quel <SPAN  CLASS="textbf">Efficient High-Level Abstractions for Web Programming</SPAN>. In <SPAN  CLASS="textit">12th International Conference on Generative Programming: Concepts &amp; Experiences (GPCE'13)</SPAN>, October 27-28, 2013 Indianapolis, IN, USA 
</DD>
<DT></DT>
<BR><DD align="justify">
Emmanuelle Rouill&#233;, Beno&#238;t Combemale, <span style="color:#428bca;">Olivier Barais</span>, David Touzet and Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Integrating Software Process Reuse and Automation</SPAN>. In <SPAN  CLASS="textit">The 20th Asia-Pacific Software Engineering Conference (APSEC 2013)</SPAN> 2-5 December 2013, Bangkok, Thailand
</DD>
<DT></DT>
<BR><DD align="justify">
Benoit Combemale, Julien Deantoni, Matias Vara Larsen, Fr&#233;d&#233;ric Mallet, <span style="color:#428bca;">Olivier Barais</span>, Benoit Baudry and Robert France. <SPAN  CLASS="textbf">Reifying Concurrency for Executable Metamodeling</SPAN>. In <SPAN  CLASS="textit">6th International Conference on Software Language Engineering (SLE 2013)</SPAN>, Indianapolis, FL, USA, in Springer's Lecture Notes in Computer Science series.
</DD>
<DT></DT>
<BR><DD align="justify">
Mathieu Acher, Benoit Combemale, Philippe Collet, <span style="color:#428bca;">Olivier Barais</span>, Philippe Lahire and Robert B. France. <SPAN  CLASS="textbf">Composing your Compositions of Variability Models</SPAN>. In <SPAN  CLASS="textit">ACM/IEEE 16th International Conference on  Model Driven Engineering Languages and Systems (MODELS'13)</SPAN>, 2013, Miami, Florida - USA 29/09 - 4/10
</DD>
<DT></DT>
<BR><DD align="justify">
Joao Bosco Ferreira Filho,  <span style="color:#428bca;">Olivier Barais</span>, Mathieu Acher J&#233;r&#244;me Le Noir and Benoit Baudry.
<SPAN  CLASS="textbf">Generating Counterexamples of Model-based Software Product Lines: An Exploratory Study</SPAN>.
 In <SPAN  CLASS="textit">17th International Conference on Software Product Lines (SPLC'13)</SPAN>, 2013, Tokyo - Japan, August 26-30,
</DD>
<DT></DT>
<BR><DD align="justify">
Max E. Kramer, Jacques Klein, Jim R. H. Steel, Brice Morin, J&#246;rg Kienzle, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel: <SPAN  CLASS="textbf">Achieving Practical Genericity in Model Weaving through Extensibility</SPAN>. <SPAN  CLASS="textit">6 th International Conference on Model Transformation (ICMT'2013)</SPAN>: 108-124, Budaptest, Hungary, June 18-19.
</DD>
<DT></DT>
<BR><DD align="justify">
Emmanuelle Rouill&#233;, Beno&#238;t Combemale, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel and David Touzet. <SPAN  CLASS="textbf">Leveraging CVL to Manage Variability in Software Process Lines</SPAhN>. <SPAN  CLASS="textit">The 19th Asia-Pacific Software Engineering Conference (APSEC 2012)</SPAN>. Hong Kong, December 04-07. 
</DD>
<DT></DT>
<BR><DD align="justify">
Fran&#231;ois Fouquet, Brice Morin, Franck Fleurey, <span style="color:#428bca;">Olivier Barais</span>, Noel Plouzeau, Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">A dynamic component model for cyber physical systems</SPAN>. 
<SPAN  CLASS="textit">In the 15th International ACM SIGSOFT Symposium on Component Based Software Engineering (CBSE 2012)</SPAN>. Bertinoro, Italy, June 26-28, 2012. 135-144
</DD>
<DT></DT>
<BR><DD align="justify">
Fran&#231;ois Fouquet, Erwan Daubert, No&#235;l Plouzeau, <span style="color:#428bca;">Olivier Barais</span>, Johann Bourcier, Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Dissemination of Reconfiguration Policies on Mesh Networks</SPAN>. <SPAN  CLASS="textit">In the 12th International IFIP Conference on Distributed Applications and Interoperable Systems (DAIS 2012)</SPAN>. Stockholm, Sweden - June 13-16, 2012, 16-30
</DD>
<DT></DT>
<BR><DD align="justify">
Olivier Beaudoux, Mickael Clavreul, Arnaud Blouin, Mengqiang Yang, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Specifying and running rich graphical components with Loa.</SPAN> <SPAN  CLASS="textit">In the fourth ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS 2012)</SPAN>: 169-178
</DD>
<DT></DT>
<BR><DD align="justify">
Gilles Perrouin, Brice Morin, Franck Chauvel, Franck Fleurey, Jacques Klein, Yves Le Traon, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Towards flexible evolution of dynamically adaptive systems</SPAN>. In <SPAN  CLASS="textit">Proceedings of the 2012 International Conference on Software Engineering (ICSE 2012)</SPAN>. IEEE Press, Piscataway, NJ, USA, 1353-1356. 
</DD>
<DT></DT>
<BR><DD align="justify">
Fran&#231;ois Fouquet, Gr&#233;gory Nain, Brice Morin, Erwan Daubert, <span style="color:#428bca;">Olivier Barais</span>, No&#235;l Plouzeau, and Jean-Marc J&#233;z&#233;quel. 2012. <SPAN  CLASS="textbf">An eclipse modelling framework alternative to meet the models@runtime requirements</SPAN>. In <SPAN  CLASS="textit">Proceedings of the 15th international conference on Model Driven Engineering Languages and Systems (MODELS'12)</SPAN>, Robert B. France, J&#252;rgen Kazmeier, Ruth Breu, and Colin Atkinson (Eds.). Springer-Verlag, Berlin, Heidelberg, 87-101. 
</DD>
<DT></DT>
<BR><DD align="justify">
Juan F. Ingles-Romero, Cristina Vicente-Chicote, Brice Morin, <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Towards the Automatic Generation of Self-Adaptive Robotics Software: An Experience Report</SPAN>. dans <SPAN  CLASS="textit">20th IEEE International Workshops on Enabling Technologies: Infrastructures for Collaborative Enterprises, (WETICE 2011)</SPAN>. Paris, France, 27-29 June 2011, Proceedings. IEEE Computer Society 2011, 79-86
</DD>
<DT></DT>
<BR><DD align="justify">
Olivier Beaudoux, Arnaud Blouin, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Specifying and implementing UI data bindings with active operations</SPAN>. dans <SPAN  CLASS="textit">Proceedings of the 3rd ACM SIGCHI Symposium on Engineering Interactive Computing System, 'EICS 2011)</SPAN>, Pisa, Italy, June 13-16, 2011. ACM 2011 127-136. 
</DD>
<DT></DT>
<BR><DD align="justify">
Franck Fleurey, Brice Morin, Arnor Solberg et <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">MDE to Manage Communications with and between Resource-Constrained Systems</SPAN>. dans <SPAN  CLASS="textit"> MODELS'11: ACM/IEEE 14th International Conference on Model Driven Engineering Languages and Systems</SPAN>, Wellington, New Zealand, October 2011.
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, Tejeddine Mouelhi, Franck Fleurey, Yves Le Traon, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Security-Driven Model-Based Dynamic Adaptation</SPAN>. dans <SPAN  CLASS="textit">25nd IEEE/ACM International Conference on Automated Software Engineering (ASE 2010)</SPAN>. Antwerp, Belgium, September. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Francoise  Andr&#233;, Erwan Daubert, Gr&#233;gory Nain, Brice Morin, Brice et <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">F4Plan: An Approach to build Efficient Adaptation Plans</SPAN>. dans <SPAN  CLASS="textit">MobiQuitous 2010</SPAN>. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Gr&#233;gory Nain, Fran&#231;ois Fouquet, Brice Morin, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Integrating IoT and IoS with a Component-Based approach</SPAN>. dans <SPAN  CLASS="textit">Proceedings of the 36th EUROMICRO Conference on Software Engineering and Advanced Applications (SEAA 2010)</SPAN>. Lille, France. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Mickael Clavreul, Olivier  Barais et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Integrating Legacy Systems with MDE</SPAN>. dans <SPAN  CLASS="textit">ICSE'10: Proceedings of the 32nd ACM/IEEE International Conference on Software Engineering</SPAN>. Cape Town, South Africa, May, pages 69-78. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Olivier Beaudoux, Arnaud Blouin, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Active Operations on Collections</SPAN>. dans <SPAN  CLASS="textit">ACM/IEEE 13th International Conference on Model Driven Engineering Languages and Systems (MODELS'10)</SPAN>. Oslo, Norway, pages 91-105. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Naouel Moha, Vincent Mah&#233;, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. 
<SPAN  CLASS="textbf">Generic Model Refactorings.</SPAN> 
dans <SPAN  CLASS="textit">ACM/IEEE 12th International Conference on Model Driven Engineering Languages and Systems (MODELS'09)</SPAN>. Denver, Colorado, USA, Oct 2009.
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, Gilles Perrouin, Philippe Lahire, <span style="color:#428bca;">Olivier Barais</span>, Gilles Vanwormhoudt et Jean-Marc J&#233;z&#233;quel. 
<SPAN  CLASS="textbf">Weaving Variability into Domain Metamodels. </SPAN>
dans <SPAN  CLASS="textit">ACM/IEEE 12th International Conference on Model Driven Engineering	Languages and Systems (MODELS'09)</SPAN>. Denver, Colorado, USA, Oct 2009.
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, Thomas Ledoux, Mahmoud Ben Hassine, Franck Chauvel, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel.
<SPAN  CLASS="textbf">Unifying Runtime Adaptation and Design Evolution. </SPAN>
dans <SPAN  CLASS="textit">IEEE 9th International Conference on Computer and Information Technology</SPAN>	(CIT'09). Xiamen, China, Oct 2009.
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, <span style="color:#428bca;">Olivier Barais</span>, Gr&#233;gory Nain et Jean-Marc J&#233;z&#233;quel 
<SPAN  CLASS="textbf">Taming Dynamically Adaptive Systems with Models and Aspects</SPAN>.
dans <SPAN  CLASS="textit">31st International Conference on Software Engineering (ICSE'09)</SPAN>, Mai 2009, Vancouver, Canada.<SMALL CLASS="SMALL">acceptation rate: 12%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Gr&#233;gory Nain , <span style="color:#428bca;">Olivier Barais</span>, R&#233;gis Fleurquin et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">EntiMid : un middleware aux services de la maison.</SPAN>
dans <SPAN  CLASS="textit">3&#232;me Conf&#233;rence Francophone sur les Architectures Logicielles</SPAN>, Nancy, France, Mars 2009.
</DD>
<DT></DT>
<BR><DD align="justify">
Gr&#233;gory Nain , Erwan Daubert , <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Using MDE to Build a Schizonfrenic Middleware for Home/Building Automation.</SPAN> dans <SPAN  CLASS="textit">ServiceWave'08: Networked European Software &amp; Services Initiative (NESSI) Conference</SPAN>. Madrid, Spain, D&#233;cembre 2008.  <SMALL CLASS="SMALL">acceptation rate: 26%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Franck Chauvel , <span style="color:#428bca;">Olivier Barais</span> , Isabelle Borne et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Composition of Qualitative Adaptation Policies.</SPAN> dans  <SPAN  CLASS="textit">23rd IEEE/ACM International Conference on Automated Software Engineering - ASE'08</SPAN>. L'Aquila, Italy, Septembre 2008.  <SMALL CLASS="SMALL">acceptation rate: 27%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin , Gilles Vanwormhoudt , Philippe Lahire , Alban	Gaignard , <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Managing Variability Complexity in Aspect-Oriented Modeling</SPAN>. dans <SPAN  CLASS="textit">MoDELS'08: 11th ACM/IEEE International Conference on Model Driven Engineering Languages and Systems</SPAN>. Toulouse, France, Octobre 2008.   <SMALL CLASS="SMALL">acceptation rate: 21%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Freddy Munoz , Benoit Baudry et <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Improving Maintenance in AOP Through an Interaction Specification Framework.</SPAN> dans <SPAN  CLASS="textit">24th IEEE International Conference onSoftware Maintenance - ICSM'08.</SPAN> Beijing, China, Septembre 2008.
  <SMALL CLASS="SMALL">acceptation rate: 24%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Franck Chauvel , <span style="color:#428bca;">Olivier Barais</span> , Noel Plouzeau , Isabelle Borne et Jean-Marc J&#233;z&#233;quel
<SPAN  CLASS="textbf">Expression qualitative de politiques d'adaptation pour Fractal.</SPAN>
dans <SPAN  CLASS="textit">Langage Mod&#232;les et Objets LMO'08</SPAN>. Montr&#233;al, Quebec, Mars 2008.  <SMALL CLASS="SMALL">acceptation rate: 30%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Diego Alonso , Cristina Vicente-Chicote et <span style="color:#428bca;">Olivier Barais</span> <SPAN  CLASS="textbf">V3Studio: A Component-Based Architecture Modeling Language.</SPAN> dans <SPAN  CLASS="textit">15th IEEE International Conference on Engineering of Computer-Based Systems (ECBS'O8)</SPAN>. Belfast, Northern Ireland, Avril 2008.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span> , Jacques Klein , Benoit Baudry , Andrew Jackson	 et Siobhan Clarke.
<SPAN  CLASS="textbf">Composing Multi-View Aspect Models.</SPAN> dans <SPAN  CLASS="textit">7th IEEE International Conference on Composition-Based Software Systems	(ICCBSS)</SPAN>. Madrid, Spain, F&#233;vrier 2008. <SMALL CLASS="SMALL">acceptation rate: 39%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Franck Chauvel , Isabelle Borne , Jean-Marc J&#233;z&#233;quel et <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">A Model-Driven Process for Self-Adaptive Software.</SPAN> dans <SPAN  CLASS="textit">4th European Congress ERTS Embedded Real-Time Software</SPAN>. Toulouse, France, Janvier 2008.   
</DD>
<DT></DT>
<BR><DD align="justify">
S&#233;bastien Saudrais, <span style="color:#428bca;">Olivier Barais</span>, et No&#235;l Plouzeau. <SPAN  CLASS="textbf">Integration of time issues into component-based applications</SPAN>. dans <SPAN  CLASS="textit">the 10th International ACM SIGSOFT Symposium on Component-Based Software Engineering (CBSE'07)</SPAN>. Springer Lecture Notes in Computer Science (LNCS), Juillet 2007, pages : 173-188.  <SMALL CLASS="SMALL">acceptation rate: 21%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Rodrigo Ramos, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Matching Model-Snippets</SPAN>. dans <SPAN  CLASS="textit">Proceedings of ACM/IEEE 10th International Conference on Model Driven Engineering Languages and Systems (MoDELS'07)</SPAN>. Nashville, TN, USA, Octobre 2007;pages 121-135 <SMALL CLASS="SMALL">acceptation rate: 26% <SPAN  CLASS="textbf">selected as one of the best papers</SPAN></SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Philippe Lahire, Brice Morin, Gilles Vanwormhoudt, Alban Gaignard, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Introducing variability into Aspect-Oriented Modeling approaches.</SPAN> dans <SPAN  CLASS="textit">Proceedings of ACM/IEEE 10th International Conference on Model Driven Engineering Languages and Systems (MoDELS 07)</SPAN>. Nashville, TN, USA, Octobre 2007, pages : 498-513. <SMALL CLASS="SMALL">acceptation rate: 26%</SMALL>
</DD>
<DT></DT>
<BR><DD align="justify">
Jacques Klein, Benoit Baudry, <span style="color:#428bca;">Olivier Barais</span> et Andrew Jackson. <SPAN  CLASS="textbf">Introduction du test dans la mod&#233;lisation par aspects</SPAN>. dans <SPAN  CLASS="textit">Troisi&#232;me Journ&#233;es sur l'Ing&#233;nierie Dirig&#233;e par les Mod&#232;les (IDM'2007)</SPAN>. Toulouse, France, Mars 2007.  
</DD>
<DT></DT>
<BR><DD align="justify">
S&#233;bastien Saudrais, <span style="color:#428bca;">Olivier Barais</span>, Laurence Duchien et No&#235;l Plouzeau <SPAN  CLASS="textbf">Int&#233;gration de propri&#233;t&#233;s temporelles dans des applications &#224; base de composants</SPAN>. dans <SPAN  CLASS="textit">Dixi&#232;me Anniversaire de la Conf&#233;rence Francophone sur les Approches Formelles dans l'Assistance au D&#233;veloppement de Logiciels (AFADL'07)</SPAN>. Namur, Belgium, Juin 2007. 
</DD>
<DT></DT>
<BR><DD align="justify">
S&#233;bastien Saudrais, <span style="color:#428bca;">Olivier Barais</span> et No&#235;l Plouzeau.
<SPAN  CLASS="textbf">Composants avec Propri&#233;t&#233;s Temporelles</SPAN>. dans <SPAN  CLASS="textit">Proceedings of the Conf&#233;rence sur les Architecture Logicielle (CAL'2006)</SPAN>. Nantes, France, Septembre 2006. 
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Julia Lawall, Julia, Anne-Fran&#231;oise Le Meur et Laurence Duchien. <SPAN  CLASS="textbf">Safe Integration of New Concerns in a Software Architecture.</SPAN> dans <SPAN  CLASS="textit">Proceedings of the 13th International Conference on Engineering of Computer Based Systems (ECBS'06)</SPAN>. Potsdam, Germany, Mars 2006. IEEE, pages 52-64.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Julia Lawall, Anne-Fran&#231;oise Le Meur et Laurence Duchien. <SPAN  CLASS="textbf">Providing Support for Safe Software Architecture Transformations.</SPAN>  dans <SPAN  CLASS="textit">Working Session of the 5th Working IEEE/IFIP Conference on Software Architecture (WICSA 2005)</SPAN>. Pittsburg, PA, USA, Novembre 2005. 
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Laurence Duchien et Anne-Francoise Le Meur. <SPAN  CLASS="textbf">A Framework to Specify Incremental Software Architecture Transformations.</SPAN> dans <SPAN  CLASS="textit">31st EUROMICRO CONFERENCE on Software Engineering and Advanced Applications (SEAA 2005)</SPAN>. Septembre 2005. IEEE Computer Society, pages 62-70. 
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span> et Laurence Duchien.
<SPAN  CLASS="textbf">SafArch : Ma&#238;triser l'Evolution d'une Architecture Logicielle.</SPAN>
Dans <SPAN  CLASS="textit">Langages, Mod&#232;les &amp; Objets, Journ&#233;es Composants, LMO 2004-JC 2004</SPAN>. Lille, France, Mars 2004. Herm&#232;s Sciences, pages 103-116.
</DD>
<DT></DT>
<BR><DD align="justify">
</DD>
</DL>


<H3><A NAME="SECTION000110400000000000000">
Workshop (proceedings) <SMALL CLASS="TINY">(Avec &#233;dition d'actes et comit&#233; de s&#233;lection)</SMALL></A>
</H3>

<P>
<BR>
<DL COMPACT>
<DD align="justify">Marianela Ciolfi Felice, Joao Bosco Filho Ferreira, Mathieu Acher, Arnaud Blouin and <span style="color:#428bca;">Olivier Barais</span>.  <SPAN  CLASS="textbf">Interactive Visualisation of Products in Online Configurators: A Case Study for Variability Modelling Technologies</SPAN>. In <SPAN  CLASS="textit">MAPLE/SCALE 2013 at SPLC 2013 Joint Workshop of MAPLE 2013 - 5th International Workshop on Model-driven Approaches in Software Product Line Engineering and SCALE 2013 - 4th Workshop on Scalable Modeling Techniques for Software Product Lines</SPAN>, 2013, Tokyo - Japan, August 26-30.
</DD>
<DT></DT>

<BR><DD align="justify">
Jo&#227;o Bosco Ferreira Filho, <span style="color:#428bca;">Olivier Barais</span>, J&#233;r&#244;me Le Noir and Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Customizing the Common Variability Language Semantics for your Domain Models</SPAN>.  In <SPAN  CLASS="textit">Vary'12 Workshop@Models'12</SPAN>. Springer-Verlag, Berlin, Heidelberg.
</DD>
<DT></DT>
<BR><DD align="justify">
Benoit Combemale, <span style="color:#428bca;">Olivier Barais</span>, Omar Alam and J&#246;rg Kienzle. <SPAN  CLASS="textbf">Using CVL to Operationalize Product Line Development with Reusable Aspect Models</SPAN>. In <SPAN  CLASS="textit">Vary'12 Workshop@Models'12</SPAN>. Springer-Verlag, Berlin, Heidelberg.
</DD>
<DT></DT>
<BR><DD align="justify">
Jo&#227;o Bosco Ferreira Filho, <span style="color:#428bca;">Olivier Barais</span>, Benoit Baudry, Windson Viana, and Rossana M. C. Andrade. 2012. <SPAN  CLASS="textbf">An approach for semantic enrichment of software product lines</SPAN>. In <SPAN  CLASS="textit">Proceedings of the 16th International Software Product Line Conference</SPAN> - Volume 2 (SPLC '12), Vol. 2. ACM, New York, NY, USA, 188-195. 
</DD>
<DT></DT>
<BR><DD align="justify">
Juan F. Ingl&#233;s-Romero,   Cristina Vicente-Chicote, Brice Morin et <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Using ModelsRuntime for Designing Adaptive Robotics Software: an Experience Report</SPAN>. Dans <SPAN  CLASS="textit">1st international workshop on Model Based Engineering for Robotics: RoSym'10 at (MODELS'10)</SPAN>. Oslo, Norway. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, Franck Fleurey, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Aspect-Oriented Modeling to Support Dynamic Adaptation</SPAN>. dans <SPAN  CLASS="textit">Forum Demo at AOSD'10</SPAN>. Rennes and St Malo, France. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Marie Gouyette, <span style="color:#428bca;">Olivier Barais</span>, J&#233;r&#244;me Le Noir et Jean-Marc J&#233;z&#233;quel.  <SPAN  CLASS="textbf">Managing variability in multi-views engineering : A live demo</SPAN>. dans <SPAN  CLASS="textit">Journ&#233;e Lignes de Produits</SPAN>. Paris, France, October. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Fran&#231;ois Fouquet, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Building a Kermeta Compiler using Scala: an Experience Report</SPAN>. dans <SPAN  CLASS="textit">Scala Days 2010</SPAN>. Lausanne, Switzerland. EPFL. (2010)
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, Gr&#233;gory Nain, <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel <SPAN  CLASS="textbf">Leveraging Models From Design-time to Runtime. A Live Demo</SPAN>. dans <SPAN  CLASS="textit">4th International Workshop on Models@Run.Time (at MODELS'09)</SPAN>. Denver, Colorado, USA, Oct 2009. 
</DD>
<DT></DT>
<BR><DD align="justify">
Franck Chauvel, <span style="color:#428bca;">Olivier Barais</span>, No&#235;l Plouzeau, Isabelle Borne, et Jean-Marc J&#233;z&#233;quel. 
<SPAN  CLASS="textbf">Composition et expression qualitative de politiques d'adaptation pour les composants fractal. </SPAN>
Dans <SPAN  CLASS="textit">Actes des Journ&#233;es nationales du GDR GPL 2009</SPAN>, Toulouse, France, January 2009
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin , <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">K@RT: An Aspect-Oriented and Model-Oriented Framework for Dynamic Software Product Lines.</SPAN> dans <SPAN  CLASS="textit">Proceedings of the Models Workshop on Models@Runtime'08. Toulouse, France, October 2008</SPAN>.
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin , <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Weaving Aspect Configurations for Managing System Variability.</SPAN> dans <SPAN  CLASS="textit">In Second International Workshop on Variability Modelling of Software-intensive Systems</SPAN>. Essen, Germany, Janvier 2008
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin , Jacques Klein , <span style="color:#428bca;">Olivier Barais</span> et Jean-Marc J&#233;z&#233;quel. 
<SPAN  CLASS="textbf">A Generic Weaver for Supporting Product Lines</SPAN>. dans <SPAN  CLASS="textit">International Workshop on Early Aspects at ICSE'08</SPAN>. Leipzig, Germany, Mai 2008.
</DD>
<DT></DT>
<BR><DD align="justify">
S&#233;bastien Saudrais, <span style="color:#428bca;">Olivier Barais</span> et Noel Plouzeau. <SPAN  CLASS="textbf">Monitoring your Lego Mindstorms with Giotto</SPAN>. dans <SPAN  CLASS="textit">Proceedings of ARTIST International Workshop on Tool Platforms for Modeling, Analysis and Validation of Embedded Systems</SPAN>. Berlin, Germany, Juillet 2007.
</DD>
<DT></DT>
<BR><DD align="justify">
Brice Morin, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel et Rodrigo Ramos. <SPAN  CLASS="textbf">Towards a generic aspect-oriented modeling framework</SPAN>. dans <SPAN  CLASS="textit">Models and Aspects workshop, at ECOOP 2007</SPAN>, July 2007.
</DD>
<DT></DT>
<BR><DD align="justify">
Pierre-Alain Muller et <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Control-theory and models at runtime.</SPAN> dans <SPAN  CLASS="textit">Proceedings of the Models Workshop on ModelsRuntime</SPAN>. Nashville, USA, Octobre 2007.
</DD>
<DT></DT>
<BR><DD align="justify">
Freddy Munoz, <span style="color:#428bca;">Olivier Barais</span> et Benoit Baudry. <SPAN  CLASS="textbf">Vigilant usage of Aspects</SPAN>. dans <SPAN  CLASS="textit">Proceedings of ADI 2007 - Workshop on Aspects, Dependencies, and Interactions at ECOOP 2007</SPAN>. Berlin, Germany, Juillet 2007.
</DD>
<DT></DT>
<BR><DD align="justify">
Jean-Marie Mottu, <span style="color:#428bca;">Olivier Barais</span>, Mark Skipper, Didier Vojtisek et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Int&#233;gration du support OCL dans Kermeta. Sp&#233;cifiez la s&#233;mantique statique de vos m&#233;ta-mod&#232;les.</SPAN> dans <SPAN  CLASS="textit">Dixi&#232;me Anniversaire de la Conf&#233;rence Francophone sur les Approches Formelles dans l'Assistance au D&#233;veloppement de Logiciels (AFADL'07)</SPAN>. Namur, Belgique, 2007.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>.  <SPAN  CLASS="textbf">S&#233;paration des pr&#233;occupations en phase de m&#233;ta-mod&#233;lisation</SPAN>. dans <SPAN  CLASS="textit">Atelier Composition de mod&#232;les (Cosmo) de la Conf&#233;rence Langage et Mod&#232;les &#224; Objets (LMO'07) et de la 3 &#232;me Journ&#233;e sur l'Ing&#233;nierie Dirig&#233;e par les Mod&#232;les</SPAN>. Toulouse, France 2007.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Franck Fleurey, Pierre-Alain Muller, Didier Vojtisek et Jean-Marc J&#233;z&#233;quel. <SPAN  CLASS="textbf">Nouvelles fonctionnalit&#233;s de Kermeta.</SPAN> dans <SPAN  CLASS="textit">Session D&#233;monstrations des 3&#232;me Journ&#233;es sur l'Ing&#233;nierie Dirig&#233;e par les Mod&#232;les</SPAN>. Toulouse, France 2007.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">SpoonEMF, une brique logicielle pour l'utilisation de l'IDM dans le cadre de la r&#233;ing&#233;nierie de programmes Java5</SPAN>. dans <SPAN  CLASS="textit">2&#232;me Journ&#233;e sur l'Ing&#233;nierie Dirig&#233;e par les Mod&#232;les</SPAN>. Lille, France 2006.
</DD>
<DT></DT>
<BR><DD align="justify">
Andrew Jackson, <span style="color:#428bca;">Olivier Barais</span>, Jean-Marc J&#233;z&#233;quel et Siobh&#225;n Clarke.
<SPAN  CLASS="textbf">Toward A Generic And Extensible Merge Operator.</SPAN> dans <SPAN  CLASS="textit">Models and Aspects workshop, at ECOOP 2006</SPAN>. Nantes, France, Juillet 2006.
 
</DD>
<DT></DT>
<BR><DD align="justify">
S&#233;bastien Saudrais, <span style="color:#428bca;">Olivier Barais</span> et Laurence Duchien. <SPAN  CLASS="textbf">Using Model-Driven Engineering to generate QoS Monitors from a formal specification.</SPAN> dans <SPAN  CLASS="textit">Proceedings of the Aquserm 2006</SPAN>. Hong Kong, China, Octobre 2006. 
</DD>
<DT></DT>
<BR><DD align="justify">
Han-Missi Tran, <span style="color:#428bca;">Olivier Barais</span>, Anne-Fran&#231;oise Le Meur et Laurence Duchien. <SPAN  CLASS="textbf">Safe Integration of New Concerns in a Software Architecture: Overview of the Implementation.</SPAN>  dans <SPAN  CLASS="textit">the 2nd International ECOOP Workshop on Architecture Centric Evolution (ACE'06)</SPAN>. Nantes, France, Juillet 2006. 
</DD>
<DT></DT>
<BR><DD align="justify">
Nicolas Pessemier, <span style="color:#428bca;">Olivier Barais</span>, Lionel Seinturier, Thierry Coupaye et Laurence Duchien. <SPAN  CLASS="textbf">A Three Level Framework for Adapting Component Based Architectures</SPAN>.  dans <SPAN  CLASS="textit">2nd Workshop on Coordination and Adaptation Techniques for Software Entities (WCAT) at ECOOP'05</SPAN>. Juillet 2005.
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Alexis Muller et Nicolas Pessemier.
<SPAN  CLASS="textbf">Extension de Fractal pour le Support des Vues au sein d'une Architecture Logicielle.</SPAN> 
Dans <SPAN  CLASS="textit">Objets Composants et Mod&#232;les dans l'ing&#233;nierie des SI</SPAN> (OCM-SI 2004). Biarritz, France, Juin 2004. 
</DD>
<DT></DT>
<BR><DD align="justify">
Nicolas Pessemier, Lionel Seinturier, Laurence Duchien et <span style="color:#428bca;">Olivier Barais</span>.
<SPAN  CLASS="textbf">Une extension de Fractal pour l'AOP.</SPAN> 
Dans <SPAN  CLASS="textit">Premi&#232;re journ&#233;e Francophone sur le D&#233;veloppement de Logiciels par Aspects</SPAN> (JFDLPA 2004). Paris, France, septembre 2004. 
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span> et Laurence Duchien.
<SPAN  CLASS="textbf">SafArchie Studio: An ArgoUML extension to build Safe Architectures.</SPAN>
Dans <SPAN  CLASS="textit">Workshop on Architecture Description Languages</SPAN> (WADL 2004). Toulouse, France, Ao&#251;t 2004. 
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Eric Cariou, Laurence Duchien, Nicolas Pessemier et Lionel Seinturier.
<SPAN  CLASS="textit">TranSAT: A Framework for the specification of Software Architecture Evolution.</SPAN>
Dans <SPAN  CLASS="textit">ECOOP First International Workshop on Coordination and Adaptation Techniques for Software Entities (WCAT04)</SPAN>. Oslo, Norway, Juin 2004. 
</DD>
<DT></DT>
<BR><DD align="justify">
<span style="color:#428bca;">Olivier Barais</span>, Laurence Duchien et Renaud Pawlak.
<SPAN  CLASS="textbf">Separation of Concerns in Software Modeling: A Framework for Software Architecture Transformation.</SPAN>
Dans <SPAN  CLASS="textit">IASTED International Conference on Software Engineering Applications</SPAN>, SEA 2003. Los Angeles, USA, Novembre. ACTA Press, pages 663-668. 
</DD>
<DT></DT>
<BR><DD align="justify">
</DD>
</DL>



<H3><A NAME="SECTION000110500000000000000">
Tutorial</A>
</H3>

<P>
<DL COMPACT>
<DD>Francois Fouquet, Erwan Daubert, Gr&#233;gory Nain, Brice Morin, Johann Bourcier, and <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Designing and Evolving Distributed Architecture using Kevoree.</SPAN> In <SPAN  CLASS="textit">17h International ACM SIGSOFT Symposium on Component-Based Software Engineering</SPAN>, Lille, France, June 30 to July 4, 2014.
</DD>
<DT></DT>
<BR><DD align="justify">
Francois Fouquet, Erwan Daubert, Gr&#233;gory Nain, Brice Morin, Johann Bourcier, and <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Designing and Evolving Distributed Architecture using Kevoree.</SPAN> In <SPAN  CLASS="textit">ACM/IFIP/USENIX International Middleware Conference</SPAN>, 2013 Bejing China, Decembre 9-13.
</DD>
<DT></DT>
<BR><DD align="justify">
Mathieu Acher, Benoit Combemale and <span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Model-Based Variability Management</SPAN>. In <SPAN  CLASS="textit">ECMFA, ECOOP and ECSA'13</SPAN>. (2013) Montpellier, France July 1-2.
</DD>
<DT></DT>
<BR><DD align="justify">
J&#233;r&#244;me Le Noir, <span style="color:#428bca;">Olivier Barais</span>, Jo&#227;o Bosco Ferreira Filho, Jean-Marc J&#233;z&#233;quel et Mathieu Acher. <SPAN  CLASS="textbf">Modelling variability using CVL; A step by step tutorial.</SPAN> Dans <SPAN  CLASS="textit">la Journ&#233;e Lignes de Produits</SPAN>, le 6 novembre 2012 &#224; Lille. 
</DD>
<DT></DT>
<BR><DD align="justify">
Marie Gouyette, <span style="color:#428bca;">Olivier Barais</span>, J&#233;r&#244;me, Lenoir, C&#233;dric Brun, Marcos Almeida Da Silva, Xavier Blanc and Jean-Marc Jezequel. <SPAN  CLASS="textbf">Movida Studio: a modeling environment to create viewpoints and manage variability in views.</SPAN> Dans <SPAN  CLASS="textit">CAL, IDM, COSMAL et GDR GPL'11</SPAN>, Lille, France 2011. 
</DD>
<DT></DT>
<BR><DD align="justify">
</DD>
</DL>



<H3><A NAME="SECTION000110600000000000000">
PhD report</A>
</H3>

<P>
<DL COMPACT>
<DD><span style="color:#428bca;">Olivier Barais</span>. <SPAN  CLASS="textbf">Construire et Ma&#238;triser l'&#233;volution d'une architecture logicielle &#224; base de composants</SPAN>. <SPAN  CLASS="textit">PhD thesis, Laboratoire d'Informatique Fondamentale de Lille/ Universit&#233; de Lille 1</SPAN>. Novembre 2005.
</DD>
<DT></DT>
<DD>
</DD>
</DL>

<P>

<BR>
R&#233;capitulatif des publications pour les ann&#233;es universitaires 2002/2014

<P>
<DIV ALIGN="CENTER">
<TABLE CELLPADDING=3 BORDER="1">
<TR><TH ALIGN="LEFT"><SPAN  CLASS="textbf">RECAPITULATIF</SPAN></TH>
<TH ALIGN="CENTER"><SPAN  CLASS="textbf">International(e)</SPAN></TH>
<TH ALIGN="CENTER"><SPAN  CLASS="textbf">National(e)</SPAN></TH>
<TH ALIGN="CENTER"><SPAN  CLASS="textbf">Total</SPAN></TH>
</TR>
<TR><TH ALIGN="LEFT"><SPAN  CLASS="textbf">Revue</SPAN></TH>
<TD ALIGN="CENTER">7</TD>
<TD ALIGN="CENTER">4</TD>
<TD ALIGN="CENTER">11</TD>
</TR>
<TR><TH ALIGN="LEFT"><SPAN  CLASS="textbf">Chapitre d'ouvrage</SPAN></TH>
<TD ALIGN="CENTER">3</TD>
<TD ALIGN="CENTER">0</TD>
<TD ALIGN="CENTER">3</TD>
</TR>
<TR><TH ALIGN="LEFT"><SPAN  CLASS="textbf">Conf&#233;rence</SPAN></TH>
<TD ALIGN="CENTER">44</TD>
<TD ALIGN="CENTER">6</TD>
<TD ALIGN="CENTER">50</TD>
</TR>
<TR><TH ALIGN="LEFT"><SPAN  CLASS="textbf">Atelier</SPAN></TH>
<TD ALIGN="CENTER">24</TD>
<TD ALIGN="CENTER">6</TD>
<TD ALIGN="CENTER">30</TD>
</TR>
<TR><TH ALIGN="LEFT"><SPAN  CLASS="textbf">Rapport de recherche</SPAN></TH>
<TD ALIGN="CENTER">2</TD>
<TD ALIGN="CENTER">4</TD>
<TD ALIGN="CENTER">6</TD>
</TR>
<TR><TH ALIGN="LEFT"><SPAN  CLASS="textbf">Total</SPAN></TH>
<TD ALIGN="CENTER">81</TD>
<TD ALIGN="CENTER">19</TD>
<TD ALIGN="CENTER">100</TD>
</TR>
</TABLE>
</DIV>





            </div>
        </div>
    </div>

    <hr>

    <div class="banner"> 
    <div class="container">
        <div class="row">
            <div class="col-lg-3">
                <!--                     <h2>You can check me out on</h2> -->
                <h2>Find me on</h2>
            </div>
            <div class="col-lg-9">
                <ul class="list-inline banner-social-buttons">
                    <li><a href="http://www.linkedin.com/in/olivierbarais" class="btn btn-default btn-lg"><i class="fa fa-linkedin-square fa-fw"></i>
                            <span class="network-name">Linkedin</span></a></li>
                    <li><a href="https://github.com/barais" class="btn btn-default btn-lg"><i class="fa fa-github-square fa-fw"></i> <span
                            class="network-name">Github</span></a></li>
                    <li><a href="http://scholar.google.fr/citations?user=LV5i8X4AAAAJ&hl=en" class="btn btn-default btn-lg"><i
                            class="fa fa-search fa-fw"></i> <span class="network-name">Scholar</span></a></li>
                    <li><a href="https://www.google.com/+OlivierBarais?rel=author" class="btn btn-default btn-lg"><i
                            class="fa fa-google-plus-square fa-fw"></i> <span class="network-name">google+</span></a></li>
                    <li><a href="https://www.facebook.com/obarais" class="btn btn-default btn-lg"><i
                            class="fa fa-facebook-square fa-fw"></i> <span class="network-name">facebook</span></a></li>
                </ul>
            </div>
        </div>
    </div>
    <!-- /.container -->

</div>
<!-- /.banner -->

<footer>
    <div class="container">
        <div class="span12 pagination-centered" style="text-align: center">
            <div class="row">
                <div class="col-lg-12">
                    <ul class="list-inline">
                        <li><a href="/">Home</a></li>
                        <li class="footer-menu-divider">&sdot;</li>
                        <!-- 						<li><a href="#about">About</a></li>
							<li class="footer-menu-divider">&sdot;</li>
	                    -->
                        <li><a href="/publications/">Publications</a></li>
                        <li class="footer-menu-divider">&sdot;</li>
                        <li><a href="/teaching/">Teaching</a></li>
                        <li class="footer-menu-divider">&sdot;</li>
                        <li><a href="/research/">Research</a></li>
                        <li class="footer-menu-divider">&sdot;</li>
                        <li><a href="/blog/">Blog</a></li>
                        <li class="footer-menu-divider">&sdot;</li>
                        <li><a href="/photos/">Photos</a></li>
                        <li class="footer-menu-divider">&sdot;</li>
                        <li><a href="/contact/">Contact</a></li>
                    </ul>

                    <p class="copyright text-muted small">
                        <a href="http://validator.w3.org/check?uri=referer"><img src="/img/valid-html401.png"
                            alt="Valid HTML 4.01 Frameset" height="20" width="57"></a> Built using <a href="http://jekyllrb.com/">Jekyll</a>, <a
                            href="http://twitter.github.com/bootstrap/">Bootstrap</a> and <a href="http://startbootstrap.com">Startbootstrap</a> from <a href="http://rudametw.github.io/">Walter Rudametkin's template</a>. All
                        source code available <a href="https://github.com/barais/barais.github.io"> here</a>. 
                    </p>
                </div>
            </div>
        </div>
    </div>
</footer>




</body>
</html>